Tekla.Structures.Model.RebarCranking.CrankedLengthTypeEnum
The cranked length type.

Tekla.Structures.Model.RebarCranking.CrankedLengthTypeEnum.DIAGONAL_RATIO
Diagonal ratio.

Tekla.Structures.Model.RebarCranking.CrankedLengthTypeEnum.DIAGONAL_DISTANCE
Diagonal distance.

Tekla.Structures.Model.RebarCranking.CrankedLengthTypeEnum.HORIZONTAL_RATIO
Horizontal ratio.

Tekla.Structures.Model.RebarCranking.CrankedLengthTypeEnum.HORIZONTAL_DISTANCE
Horizontal distance.